#include<iostream>

using namespace std;
/* 阿迪和他的朋友一共k个人，分吃n颗糖，每颗糖只能分给他们中的某个人或者丢弃。

         人的编号从1到k，阿迪是第1号。阿迪将选择一个正整数x来分糖，他先给自己x颗，然后给下一个人x颗，再给第三个人x颗，如此继续，循环往复。剩余的（不能整除x的部分）将会丢弃。

         阿迪不能选择大于M的x去分配，因为这样会被别人认为太贪心（嘿嘿，其实他真的很贪心）。还有，他不能选择一个小的x，使得有人会收到糖的次数超过D，这样会被认为分得太慢。

         阿迪想请你找出一个有效的x，保证让阿迪能得到最多的糖。
【输入形式】

         输入为一行4个整数n、k、M和D，分别表示糖的数量、人的数量、每次能分配的最大数量、人可以收到糖的最大次数。

【输出形式】

         输出为一个整数，表示阿迪自己能收到的最大可能的糖的颗数。
		 
		 入机贪心算法！！！！！*/
int main()
{
	int n,k,M,D;
	
	cin>>n>>k>>M>>D;
	int R = min(M,n);
	
	if (R == n) {
        cout << n << endl;
        return 0;
    }
    
	int c =( n / M - 1 ) / k + 1;
	
	int ans1 = c * R;
	int ans2 = 0;
	
	if (c < D){	
		int p1 = n / (c * k + 1);
		ans2 = (c + 1) * p1;
    }
	
	
	int ans = max(ans1,ans2);
	cout<<ans;
}
